app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2020-08-31 15:58:55.684403"], ["updated_at", "2020-08-31 15:58:55.684403"]]
---
  def create
    @article = Article.new
    @article.title = params[:title]
    @article.description = params[:description]
    @article.save

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-08-31 16:04:00.529974"], ["id", 1]]
---
  def update
    @article = find_article
    @article.update(article_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_article
    @article = Article.find(params[:id])